[{  
    "feats":{ 

        "001":{ 
            "name": "Aberrant Dragonmark", 
            "prerequisite": "No other dragonmark",
            "description": "You have manifeste d an aberrant dragonmark. Determine its appearance and the flaw associated with it. You gain the following benefits:\nIncrease your Constitution score by 1, to a maximum of 20.\nYou learn a cantrip of your choice from the sorcerer spell list. In addition, choose a 1st-level spell from the sorcerer spell list. You learn that spell and can cast it through your mark. Once you cast it, you must finish a short or long rest before you can cast it again through the mark. Constitution is your spellcasting ability for these spells.\nWhen you cast the 1st-level spell through your mark, you can expend one of your Hit Dice and roll it. If you roll an even number, you gain a number of temporary hit points equal to the number rolled. If you roll an odd number, one random creature within 30 feet of you (not including you) takes force damage equal to the number rolled. If no other creatures are in range, you take the damage.\nYou also develop a random flaw from the Aberrant Dragonmark Flaws table.\n\nAberrant Dragonmark Flaws\nd8        Flaw\n1        Your mark is a source of constant physical pain.\n2        Your mark whispers to you. Its meaning can be unclear.\n3        When you're stressed, the mark hisses audibly.\n4        The skin around the mark is burned, scaly, or withered.\n5        Animals are uneasy around you.\n6        You have a mood swing any time you use your mark.\n7        Your looks change slightly whenever you use the mark.\n8        You have horrific nightmares after you use your mark.\nOption: Greater Aberrant Powers\nAt the DM's option, a character who has the Aberrant Dragonmark feat has a chance of manifesting greater power. Upon reaching 10th level, such a character has a 10 percent chance of gaining an epic boon from among the options in chapter 7 of the Dungeon Master's Guide. If the character fails to gain a boon, they have a 10 percent chance the next time they gain a level.\n\nIf the character gains a boon, the DM chooses it or determines it randomly. The character also permanently loses one of their Hit Dice, and their hit point maximum is reduced by an amount equal to a roll of that die plus their Constitution modifier (minimum reduction of 1). This reduction can't be reversed by any means.",
            "ability": "con", 
            "source": "ERLW" 
        }, 
        "001":{ 
            "name": "Actor", 
            "prerequisite": "", 
            "description": "Skilled at mimicry and dramatics, you gain the following benefits:\nIncrease your Charisma score by 1, to a maximum of 20.\nYou have advantage on Charisma (Deception) and Charisma (Performance) checks when trying to pass yourself off as a different person.\nYou can mimic the speech of another person or the sounds made by other creatures. You must have heard the person speaking, or heard the creature make the sound, for at least 1 minute. A successful Wisdom (Insight) check contested by your Charisma (Deception) check allows a listener to determine that the effect is faked.",
            "ability": "cha", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Alert", 
            "prerequisite": "", 
            "description": "Always on the look out for danger, you gain the following benefits:\nYou gain a +5 bonus to initiative.\nYou can't be surprised while you are conscious.\nOther creatures don't gain advantage on attack rolls against you as a result of being unseen by you.",
            "ability": "", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Artificer Initiate", 
            "prerequisite": "", 
            "description": "You've learned som e of an artificer's inventiveness:\nYou learn one cantrip of your choice from the artificer spell list, and you learn one 1st-level spell of your choice from that list. Intelligence is your spellcasting ability for these spells.\nYou can cast this feat's 1st-level spell without a spell slot, and you must finish a long rest before you can cast it in this way again. You can also cast the spell using any spell slots you have.\nYou gain proficiency with one type of artisan's tools of your choice, and you can use that type of tool as a spellcasting focus for any spell you cast that uses Intelligence as its spellcasting ability.",
            "ability": "", 
            "source": "TCE" 
        }, 
        "001":{ 
            "name": "Athlete", 
            "prerequisite": "", 
            "description": "You have undergone extensive physical training to gain the following benefits:\nIncrease your Strength or Dexterity by 1, to a maximum of 20.\nWhen you are prone, standing up uses only 5 feet of your movement.\nClimbing doesn't cost you extra movement.\nYou can make a running long jump or a running high jump after moving only 5 feet on foot, rather than 10 feet.",
            "ability": "str dex", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Bountiful Luck", 
            "prerequisite": "Halfling", 
            "description": "Your people have e xtraordinary luck, which you have learned to mystically lend to your companions when you see them falter. You're not sure how you do it; you just wish it, and it happens. Surely a sign of fortune's favor!\nWhen an ally you can see within 30 feet of you rolls a 1 on the d20 for an attack roll, an ability check, or a saving throw, you can use your reaction to let the ally reroll the die. The ally must use the new roll.\n\nWhen you use this ability, you can't use your Lucky racial trait before the end of your next turn.",
            "ability": "", 
            "source": "XGE" 
        }, 
        "001":{ 
            "name": "Charger", 
            "prerequisite": "", 
            "description": "When you use your action to Dash, you can use a bonus action to make one melee weapon attack or to shove a creature.\nIf you move at least 10 feet in a straight line immediately before taking this bonus action, you either gain a +5 bonus to the attack's damage roll (if you chose to make a melee attack and hit) or push the target up to 10 feet away from you (if you chose to shove and you succeed).",
            "ability": "", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Chef", 
            "prerequisite": "", 
            "description": "Time spent masteri ng the culinary arts has paid off, granting you the following benefits:\nIncrease your Constitution or Wisdom by 1, to a maximum of 20.\nYou gain proficiency with cook's utensils if you don't already have it.\nAs part of a short rest, you can cook special food, provided you have ingredients and cook's utensils on hand. You can prepare enough of this food for a number of creatures equal to 4 + your proficiency bonus. At the end of the short rest, any creature who eats the food and spends one or more Hit Dice to regain hit points regains an extra 1d8 hit points.\nWith one hour of work or when you finish a long rest, you can cook a number of treats equal to your proficiency bonus. These special treats last 8 hours after being made. A creature can use a bonus action to eat one of those treats to gain temporary hit points equal to your proficiency bonus.",
            "ability": "con wis", 
            "source": "TCE" 
        }, 
        "001":{ 
            "name": "Crossbow Expert", 
            "prerequisite": "", 
            "description": "Thanks to extensiv e practice with the crossbow, you gain the following benefits:\nYou ignore the loading quality of crossbows with which you are proficient.\nBeing within 5 feet of a hostile creature doesn't impose disadvantage on your ranged attack rolls.\nWhen you use the Attack action and attack with a one-handed weapon, you can use a bonus action to attack with a hand crossbow you are holding.",
            "ability": "", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Crusher", 
            "prerequisite": "", 
            "description": "You are practiced in the art of crushing your enemies, granting you the following benefits:\nIncrease your Strength or Constitution by 1, to a maximum of 20.\nOnce per turn, when you hit a creature with an attack that deals bludgeoning damage, you can move it 5 feet to an unoccupied space, provided the target is no more than one size larger than you.\nWhen you score a critical hit that deals bludgeoning damage to a creature, attack rolls against that creature are made with advantage until the start of your next turn.",
            "ability": "str con", 
            "source": "TCE" 
        }, 
        "001":{ 
            "name": "Defensive Duelist", 
            "prerequisite": "Dexterity 13 or h igher",
            "description": "When you are wield ing a finesse weapon with which you are proficient and another creature hits you with a melee attack, you can use your reaction to add your proficiency bonus to your AC for that attack, potentially causing the attack to miss you.",
            "ability": "", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Dragon Fear", 
            "prerequisite": "Dragonborn", 
            "description": "When angered, you radiate menace. You gain the following benefits:\nIncrease your Strength, Constitution, or Charisma by 1, to a maximum of 20.\nInstead of exhaling destructive energy, you can expend a use of your Breath Weapon trait to roar, forcing each creature of your choice within 30 feet of you to make a Wisdom saving throw (DC 8 + your proficiency bonus + your Charisma modifier). A target automatically succeeds on the save if it can't hear or see you. On a failed save, a target becomes frightened of you for 1 minute. If the frightened target takes any damage, it can repeat the saving throw, ending the effect on itself on a success.",
            "ability": "str con cha", 
            "source": "XGE" 
        }, 
        "001":{ 
            "name": "Dragon Hide", 
            "prerequisite": "Dragonborn", 
            "description": "You manifest scale s and claws reminiscent of your draconic ancestors. You gain the following benefits:\nIncrease your Strength, Constitution, or Charisma by 1, to a maximum of 20.\nYour scales harden. While you aren't wearing armor, you can calculate your AC as 13 + your Dexterity modifier. You can use a shield and still gain this benefit.\nYou grow retractable claws from the tips of your fingers. Extending or retracting the claws requires no action. The claws are natural weapons, which you can use to make unarmed strikes. If you hit with them, you deal slashing damage equal to 1d4 + your Strength modifier, instead of the normal bludgeoning damage for an unarmed strike.",
            "ability": "str con cha", 
            "source": "XGE" 
        }, 
        "001":{ 
            "name": "Drow High Magic", 
            "prerequisite": "Elf (drow)", 
            "description": "You learn more of the magic typical of dark elves. You learn the detect magic spell and can cast it at will, without expending a spell slot. You also learn levitate and dispel magic, each of which you can cast once without expending a spell slot. You regain the ability to cast those two spells in this way when you finish a long rest. Charisma is your spellcasting ability for all three spells.",
            "ability": "", 
            "source": "XGE" 
        }, 
        "001":{ 
            "name": "Dual Wielder", 
            "prerequisite": "", 
            "description": "You master fightin g with two weapons, gaining the following benefits:\nYou gain a +1 bonus to AC while you are wielding a separate melee weapon in each hand.\nYou can use two-weapon fighting even when the one-handed melee weapons you are wielding aren't light.\nYou can draw or stow two one-handed weapons when you would normally be able to draw or stow only one.",
            "ability": "", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Dungeon Delver", 
            "prerequisite": "", 
            "description": "Alert to the hidde n traps and secret doors found in many dungeons, you gain the following benefits:\nYou have advantage on Wisdom (Perception) and Intelligence (Investigation) checks made to detect the presence of secret doors.\nYou have advantage on saving throws made to avoid or resist traps.\nYou have resistance to the damage dealt by traps.\nTraveling at a fast pace doesn't impose the normal -5 penalty on your passive Wisdom (Perception) score.",
            "ability": "", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Durable", 
            "prerequisite": "", 
            "description": "Hardy and resilien t, you gain the following benefits:\nIncrease your Constitution score by 1, to a maximum of 20.\nWhen you roll a Hit Die to regain hit points, the minimum number of hit points you regain from the roll equals twice your Constitution modifier (minimum of 2).",
            "ability": "con", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Dwarven Fortitude", 
            "prerequisite": "Dwarf", 
            "description": "You have the blood of dwarf heroes flowing through your veins. You gain the following benefits:\nIncrease your Constitution score by 1, to a maximum of 20.\nWhenever you take the Dodge action in combat, you can spend one Hit Die to heal yourself. Roll the die, add your Constitution modifier, and regain a number of hit points equal to the total (minimum of 1).",
            "ability": "con", 
            "source": "XGE" 
        }, 
        "001":{ 
            "name": "Eldritch Adept", 
            "prerequisite": "Spellcasting or P act Magic feature",
            "description": "Studying occult lo re, you have unlocked eldritch power within yourself: you learn one Eldritch Invocation option of your choice from the warlock class. If the invocation has a prerequisite of any kind, you can choose that invocation only if you're a warlock who meets the prerequisite.\nWhenever you gain a level, you can replace the invocation with another one from the warlock class.",
            "ability": "", 
            "source": "TCE" 
        }, 
        "001":{ 
            "name": "Elemental Adept", 
            "prerequisite": "The ability to ca st at least one spell",
            "description": "When you gain this feat, choose one of the following damage types: acid, cold, fire, lightning, or thunder.\nSpells you cast ignore resistance to damage of the chosen type. In addition, when you roll damage for a spell you cast that deals damage of that type, you can treat any 1 on a damage die as a 2.\n\nYou can select this feat multiple times. Each time you do so, you must choose a different damage type.",
            "ability": "", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Elven Accuracy", 
            "prerequisite": "Elf or half-elf", 
            "description": "The accuracy of el ves is legendary, especially that of elf archers and spellcasters. You have uncanny aim with attacks that rely on precision rather than brute force. You gain the following benefits:\nIncrease your Dexterity, Intelligence, Wisdom, or Charisma by 1, to a maximum of 20.\nWhenever you have advantage on an attack roll using Dexterity, Intelligence, Wisdom, or Charisma, you can reroll one of the dice once.",
            "ability": "dex int wis cha", 
            "source": "XGE" 
        }, 
        "001":{ 
            "name": "Fade Away", 
            "prerequisite": "Gnome", 
            "description": "Your people are cl ever, with a knack for illusion magic. You have learned a magical trick for fading away when you suffer harm. You gain the following benefits:\nIncrease your Dexterity or Intelligence by 1, to a maximum of 20.\nImmediately after you take damage, you can use a reaction to magically become invisible until the end of your next turn or until you attack, deal damage, or force someone to make a saving throw. Once you use this ability, you can't do so again until you finish a short or long rest.",
            "ability": "dex int", 
            "source": "XGE" 
        }, 
        "001":{ 
            "name": "Fey Teleportation", 
            "prerequisite": "Elf (high)", 
            "description": "Your study of high elven lore has unlocked fey power that few other elves possess, except your eladrin cousins. Drawing on your fey ancestry, you can momentarily stride through the Feywild to shorten your path from one place to another. You gain the following benefits:\nIncrease your Intelligence or Charisma by 1, to a maximum of 20.\nYou learn to speak, read, and write Sylvan.\nYou learn the misty step spell and can cast it once without expending a spell slot. You regain the ability to cast it in this way when you finish a short or long rest. Intelligence is your spellcasting ability for this spell.",
            "ability": "int cha", 
            "source": "XGE" 
        }, 
        "001":{ 
            "name": "Fey Touched", 
            "prerequisite": "", 
            "description": "Your exposure to t he Feywild's magic has changed you, granting you the following benefits:\nIncrease your Intelligence, Wisdom, or Charisma by 1, to a maximum of 20.\nYou learn the misty step spell and one 1st-level spell of your choice. The 1st-level spell must be from the divination or enchantment school of magic. You can cast each of these spells without expending a spell slot. Once you cast either of these spells in this way, you can't cast that spell in this way again until you finish a long rest. You can also cast these spells using spell slots you have of the appropriate level. The spells' spellcasting ability is the ability increased by this feat.",
            "ability": "int wis cha", 
            "source": "TCE" 
        }, 
        "001":{ 
            "name": "Fighting Initiate", 
            "prerequisite": "Proficiency with a martial weapon",
            "description": "Your martial train ing has helped you develop a particular style of fighting. As a result, you learn one Fighting Style option of your choice from the fighter class. If you already have a style, the one you choose must be different.\nWhenever you reach a level that grants the Ability Score Improvement feature, you can replace this feat's fighting style with another one from the fighter class that you don't have.",
            "ability": "", 
            "source": "TCE" 
        }, 
        "001":{ 
            "name": "Flames of Phlegethos", 
            "prerequisite": "Tiefling", 
            "description": "You learn to call on hellfire to serve your commands. You gain the following benefits:\nIncrease your Intelligence or Charisma by 1, to a maximum of 20.\nWhen you roll fire damage for a spell you cast, you can reroll any roll of 1 on the fire damage dice, but you must use the new roll, even if it is another 1.\nWhenever you cast a spell that deals fire damage, you can cause flames to wreathe you until the end of your next turn. The flames don't harm you or your possessions, and they shed bright light out to 30 feet and dim light for an additional 30 feet. While the flames are present, any creature within 5 feet of you that hits you with a melee attack takes 1d4 fire damage.",
            "ability": "int cha", 
            "source": "XGE" 
        }, 
        "001":{ 
            "name": "Grappler", 
            "prerequisite": "Strength 13 or hi gher",
            "description": "You've developed t he skills necessary to hold your own in close-quarters grappling. You gain the following benefits:\nYou have advantage on attack rolls against a creature you are grappling.\nYou can use your action to try to pin a creature grappled by you. To do so, make another grapple check. If you succeed, you and the creature are both restrained until the grapple ends.",
            "ability": "", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Great Weapon Master", 
            "prerequisite": "", 
            "description": "You've learned to put the weight of a weapon to your advantage, letting its momentum empower your strikes. You gain the following benefits:\nOn your turn, when you score a critical hit with a melee weapon or reduce a creature to 0 hit points with one, you can make one melee weapon attack as a bonus action.\nBefore you make a melee attack with a heavy weapon that you are proficient with, you can choose to take a -5 penalty to the attack roll. If the attack hits, you add +10 to the attack's damage.",
            "ability": "", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Gunner", 
            "prerequisite": "", 
            "description": "You have a quick h and and keen eye when employing firearms, granting you the following benefits:\nIncrease your Dexterity score by 1, to a maximum of 20.\nYou gain proficiency with firearms (see \"Firearms\" in the Dungeon Master's Guide).\nYou ignore the loading property of firearms.\nBeing within 5 feet of a hostile creature doesn't impose disadvantage on your ranged attack rolls.",
            "ability": "dex", 
            "source": "TCE" 
        }, 
        "001":{ 
            "name": "Healer", 
            "prerequisite": "", 
            "description": "You are an able ph ysician, allowing you to mend wounds quickly and get your allies back in the fight. You gain the following benefits:\nWhen you use a healer's kit to stabilize a dying creature, that creature also regains 1 hit point.\nAs an action, you can spend one use of a healer's kit to tend to a creature and restore 1d6 + 4 hit points to it, plus additional hit points equal to the creature's maximum number of Hit Dice. The creature can't regain hit points from this feat again until it finishes a short or long rest.",
            "ability": "", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Heavily Armored", 
            "prerequisite": "Proficiency with medium armor",
            "description": "You have trained t o master the use of heavy armor, gaining the following benefits:\nIncrease your Strength score by 1, to a maximum of 20.\nYou gain proficiency with heavy armor.",
            "ability": "str", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Heavy Armor Master", 
            "prerequisite": "Proficiency with heavy armor",
            "description": "You can use your a rmor to deflect strikes that would kill others. You gain the following benefits:\nIncrease your Strength score by 1, to a maximum of 20.\nWhile you are wearing heavy armor, bludgeoning, piercing, and slashing damage that you take from nonmagical weapons is reduced by 3.",
            "ability": "str", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Infernal Constitution", 
            "prerequisite": "Tiefling", 
            "description": "Fiendish blood run s strong in you, unlocking a resilience akin to that possessed by some fiends. You gain the following benefits:\nIncrease your Constitution score by 1, to a maximum of 20.\nYou have resistance to cold and poison damage.\nYou have advantage on saving throws against being poisoned.",
            "ability": "con", 
            "source": "XGE" 
        }, 
        "001":{ 
            "name": "Inspiring Leader", 
            "prerequisite": "Charisma 13 or hi gher",
            "description": "You can spend 10 m inutes inspiring your companions, shoring up their resolve to fight. When you do so, choose up to six friendly creatures (which can include yourself) within 30 feet of you who can see or hear you and who can understand you. Each creature can gain temporary hit points equal to your level + your Charisma modifier. A creature can't gain temporary hit points from this feat again until it has finished a short or long rest.",
            "ability": "", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Keen Mind", 
            "prerequisite": "", 
            "description": "You have a mind th at can track time, direction, and detail with uncanny precision. You gain the following benefits:\nIncrease your Intelligence score by 1, to a maximum of 20.\nYou always know which way is north.\nYou always know the number of hours left before the next sunrise or sunset.\nYou can accurately recall anything you have seen or heard within the past month.",
            "ability": "int", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Lightly Armored", 
            "prerequisite": "", 
            "description": "You have trained t o master the use of light armor, gaining the following benefits:\nIncrease your Strength or Dexterity by 1, to a maximum of 20.\nYou gain proficiency with light armor.",
            "ability": "str dex", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Linguist", 
            "prerequisite": "", 
            "description": "You have studied l anguages and codes, gaining the following benefits:\nIncrease your Intelligence score by 1, to a maximum of 20.\nYou learn three languages of your choice.\nYou can ably create written ciphers. Others can't decipher a code you create unless you teach them, they succeed on an Intelligence check (DC equal to your Intelligence score + your proficiency bonus), or they use magic to decipher it.",
            "ability": "int", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Lucky", 
            "prerequisite": "", 
            "description": "You have inexplica ble luck that seems to kick in at just the right moment.\nYou have 3 luck points. Whenever you make an attack roll, an ability check, or a saving throw, you can spend one luck point to roll an additional d20. You can choose to spend one of your luck points after you roll the die, but before the outcome is determined. You choose which of the d20s is used for the attack roll, ability check, or saving throw.\n\nYou can also spend one luck point when an attack roll is made against you. Roll a d20, and then choose whether the attack uses the attacker's roll or yours. If more than one creature spends a luck point to influence the outcome of a roll, the points cancel each other out; no additional dice are rolled.\n\nYou regain your expended luck points when you finish a long rest.",
            "ability": "", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Mage Slayer", 
            "prerequisite": "", 
            "description": "You have practiced techniques useful in melee combat against spellcasters, gaining the following benefits:\nWhen a creature within 5 feet of you casts a spell, you can use your reaction to make a melee weapon attack against that creature.\nWhen you damage a creature that is concentrating on a spell, that creature has disadvantage on the saving throw it makes to maintain its concentration.\nYou have advantage on saving throws against spells cast by creatures within 5 feet of you.",
            "ability": "", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Magic Initiate", 
            "prerequisite": "", 
            "description": "Choose a class: ba rd, cleric, druid, sorcerer, warlock, or wizard. You learn two cantrips of your choice from that class's spell list.\nIn addition, choose one 1st-level spell from that same list. You learn that spell and can cast it at its lowest level. Once you cast it, you must finish a long rest before you can cast it again using this feat.\n\nYour spellcasting ability for these spells depends on the class you chose: Charisma for bard, sorcerer, or warlock; Wisdom for cleric or druid; or Intelligence for wizard.",
            "ability": "", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Martial Adept", 
            "prerequisite": "", 
            "description": "You have martial t raining that allows you to perform special combat maneuvers. You gain the following benefits:\nYou learn two maneuvers of your choice from among those available to the Battle Master archetype in the fighter class. If a maneuver you use requires your target to make a saving throw to resist the maneuver's effects, the saving throw DC equals 8 + your proficiency bonus + your Strength or Dexterity modifier (your choice).\nYou gain one superiority die, which is a d6 (this die is added to any superiority dice you have from another source). This die is used to fuel your maneuvers. A superiority die is expended when you use it. You regain your expended superiority dice when you finish a short or long rest.",
            "ability": "", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Medium Armor Master", 
            "prerequisite": "Proficiency with medium armor",
            "description": "You have practiced moving in medium armor to gain the following benefits:\nWearing medium armor doesn't impose disadvantage on your Dexterity (Stealth) checks.\nWhen you wear medium armor, you can add 3, rather than 2, to your AC if you have a Dexterity of 16 or higher.",
            "ability": "", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Metamagic Adept", 
            "prerequisite": "Spellcasting or P act Magic feature",
            "description": "You've learned how to exert your will on your spells to alter how they function:\nYou learn two Metamagic options of your choice from the sorcerer class. You can use only one Metamagic option on a spell when you cast it, unless the option says otherwise. Whenever you reach a level that grants the Ability Score Improvement feature, you can replace one of these Metamagic options with another one from the sorcerer class.\nYou gain 2 sorcery points to spend on Metamagic (these points are added to any sorcery points you have from another source but can be used only on Metamagic). You regain all spent sorcery points when you finish a long rest.",
            "ability": "", 
            "source": "TCE" 
        }, 
        "001":{ 
            "name": "Mobile", 
            "prerequisite": "", 
            "description": "You are exceptiona lly speedy and agile. You gain the following benefits:\nYour speed increases by 10 feet.\nWhen you use the Dash action, difficult terrain doesn't cost you extra movement on that turn.\nWhen you make a melee attack against a creature, you don't provoke opportunity attacks from that creature for the rest of the turn, whether you hit or not.",
            "ability": "", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Moderately Armored", 
            "prerequisite": "Proficiency with light armor",
            "description": "You have trained t o master the use of medium armor and shields, gaining the following benefits:\nIncrease your Strength or Dexterity by 1, to a maximum of 20.\nYou gain proficiency with medium armor and shields.",
            "ability": "str dex", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Mounted Combatant", 
            "prerequisite": "", 
            "description": "You are a dangerou s foe to face while mounted. While you are mounted and aren't incapacitated, you gain the following benefits:\nYou have advantage on melee attack rolls against any unmounted creature that is smaller than your mount.\nYou can force an attack targeted at your mount to target you instead.\nIf your mount is subjected to an effect that allows it to make a Dexterity saving throw to take only half damage, it instead takes no damage if it succeeds on the saving throw, and only half damage if it fails.",
            "ability": "", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Observant", 
            "prerequisite": "", 
            "description": "Quick to notice de tails of your environment, you gain the following benefits:\nIncrease your Intelligence or Wisdom by 1, to a maximum of 20.\nIf you can see a creature's mouth while it is speaking a language you understand, you can interpret what it's saying by reading its lips.\nYou have a +5 bonus to your passive Wisdom (Perception) and passive Intelligence (Investigation) scores.",
            "ability": "int wis", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Orcish Fury", 
            "prerequisite": "Half-Orc", 
            "description": "Your fury burns ti relessly. You gain the following benefits:\nIncrease your Strength or Constitution by 1, to a maximum of 20.\nWhen you hit with an attack using a simple or martial weapon, you can roll one of the weapon's damage dice an additional time and add it as extra damage of the weapon's damage type. Once you use this ability, you can't use it again until you finish a short or long rest.\nImmediately after you use your Relentless Endurance trait, you can use your reaction to make one weapon attack.",
            "ability": "str con", 
            "source": "XGE" 
        }, 
        "001":{ 
            "name": "Piercer", 
            "prerequisite": "", 
            "description": "You have achieved a penetrating precision in combat, granting you the following benefits:\nIncrease your Strength or Dexterity by 1, to a maximum of 20.\nOnce per turn, when you hit a creature with an attack that deals piercing damage, you can reroll one of the attack's damage dice, and you must use the new roll.\nWhen you score a critical hit that deals piercing damage to a creature, you can roll one additional damage die when determining the extra piercing damage the target takes.",
            "ability": "str dex", 
            "source": "TCE" 
        }, 
        "001":{ 
            "name": "Poisoner", 
            "prerequisite": "", 
            "description": "You can prepare an d deliver deadly poisons, granting you the following benefits:\nWhen you make a damage roll that deals poison damage, it ignores resistance to poison damage.\nYou can apply poison to a weapon or piece of ammunition as a bonus action, instead of an action.\nYou gain proficiency with the poisoner's kit if you don't already have it. With one hour of work using a poisoner's kit and expending 50 gp worth of materials, you can create a number of doses of potent poison equal to your proficiency bonus. Once applied to a weapon or piece of ammunition, the poison retains its potency for 1 minute or until you hit with the weapon or ammunition. When a creature takes damage from the coated weapon or ammunition, that creature must succeed on a DC 14 Constitution saving throw or take 2d8 poison damage and become poisoned until the end of your next turn.",
            "ability": "", 
            "source": "TCE" 
        }, 
        "001":{ 
            "name": "Polearm Master", 
            "prerequisite": "", 
            "description": "You can keep your enemies at bay with reach weapons. You gain the following benefits:\nWhen you take the Attack action and attack with only a glaive, halberd, quarterstaff, or spear, you can use a bonus action to make a melee attack with the opposite end of the weapon; this attack uses the same ability modifier as the primary attack. The weapon's damage die for this attack is a d4, and the attack deals bludgeoning damage.\nWhile you are wielding a glaive, halberd, pike, quarterstaff, or spear, other creatures provoke an opportunity attack from you when they enter your reach.",
            "ability": "", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Prodigy", 
            "prerequisite": "Half-Elf, half-or c, or human",
            "description": "You have a knack f or learning new things. You gain the following benefits:\nYou gain one skill proficiency of your choice, one tool proficiency of your choice, and fluency in one language of your choice.\nChoose one skill in which you have proficiency. You gain expertise with that skill, which means your proficiency bonus is doubled for any ability check you make with it. The skill you choose must be one that isn't already benefiting from a feature, such as Expertise, that doubles your proficiency bonus.",
            "ability": "", 
            "source": "XGE" 
        }, 
        "001":{ 
            "name": "Resilient", 
            "prerequisite": "", 
            "description": "Choose one ability score. You gain the following benefits:\nIncrease the chosen ability score by 1, to a maximum of 20.\nYou gain proficiency in saving throws using the chosen ability.",
            "ability": "str dex con int wis ch a",
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Revenant Blade", 
            "prerequisite": "Elf", 
            "description": "You are descended from a master of the double-bladed scimitar, and some of that mastery has passed on to you. You gain the following benefits:\nIncrease your Strength or Dexterity by 1, to a maximum of 20.\nWhile you are holding a double-bladed scimitar with two hands, you gain a +1 bonus to Armor Class.\nA double-bladed scimitar has the finesse property when you wield it.",
            "ability": "str dex", 
            "source": "ERLW" 
        }, 
        "001":{ 
            "name": "Ritual Caster", 
            "prerequisite": "Intelligence or W isdom 13 or higher",
            "description": "You have learned a number of spells that you can cast as rituals. These spells are written in a ritual book, which you must have in hand while casting one of them.\nWhen you choose this feat, you acquire a ritual book holding two 1st-level spells of your choice. Choose one of the following classes: bard, cleric, druid, sorcerer, warlock, or wizard. You must choose your spells from that class's spell list, and the spells you choose must have the ritual tag. The class you choose also determines your spellcasting ability for these spells: Charisma for bard, sorcerer, or warlock; Wisdom for cleric or druid; or Intelligence for wizard.\n\nIf you come across a spell in written form, such as a magical spell scroll or a wizard's spellbook, you might be able to add it to your ritual book. The spell must be on the spell list for the class you chose, the spell's level can be no higher than half your level (rounded up), and it must have the ritual tag. The process of copying the spell into your ritual book takes 2 hours per level of the spell, and costs 50 gp per level. The cost represents material components you expend as you experiment with the spell to master it, as well as the fine inks you need to record it.",
            "ability": "", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Savage Attacker", 
            "prerequisite": "", 
            "description": "Once per turn when you roll damage for a melee weapon attack, you can reroll the weapon's damage dice and use either total.",
            "ability": "", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Second Chance", 
            "prerequisite": "Halfling", 
            "description": "Fortune favors you when someone tries to strike you. You gain the following benefits:\nIncrease your Dexterity, Constitution, or Charisma by 1, to a maximum of 20.\nWhen a creature you can see hits you with an attack roll, you can use your reaction to force that creature to reroll. Once you use this ability, you can't use it again until you roll initiative at the start of combat or until you finish a short or long rest.",
            "ability": "dex con cha", 
            "source": "XGE" 
        }, 
        "001":{ 
            "name": "Sentinel", 
            "prerequisite": "", 
            "description": "You have mastered techniques to take advantage of every drop in any enemy's guard, gaining the following benefits:\nWhen you hit a creature with an opportunity attack, the creature's speed becomes 0 for the rest of the turn.\nCreatures provoke opportunity attacks from you even if they take the Disengage action before leaving your reach.\nWhen a creature within 5 feet of you makes an attack against a target other than you (and that target doesn't have this feat), you can use your reaction to make a melee weapon attack against the attacking creature.",
            "ability": "", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Shadow Touched", 
            "prerequisite": "", 
            "description": "Your exposure to t he Shadowfell's magic has changed you, granting you the following benefits:\nIncrease your Intelligence, Wisdom, or Charisma by 1, to a maximum of 20.\nYou learn the invisibility spell and one 1st-level spell of your choice. The 1st-level spell must be from the illusion or necromancy school of magic. You can cast each of these spells without expending a spell slot. Once you cast either of these spells in this way, you can't cast that spell in this way again until you finish a long rest. You can also cast these spells using spell slots you have of the appropriate level. The spells' spellcasting ability is the ability increased by this feat.",
            "ability": "int wis cha", 
            "source": "TCE" 
        }, 
        "001":{ 
            "name": "Sharpshooter", 
            "prerequisite": "", 
            "description": "You have mastered ranged weapons and can make shots that others find impossible. You gain the following benefits:\nAttacking at long range doesn't impose disadvantage on your ranged weapon attack rolls.\nYour ranged weapon attacks ignore half cover and three-quarters cover.\nBefore you make an attack with a ranged weapon that you are proficient with, you can choose to take a -5 penalty to the attack roll. If the attack hits, you add +10 to the attack's damage.",
            "ability": "", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Shield Master", 
            "prerequisite": "", 
            "description": "You use shields no t just for protection but also for offense. You gain the following benefits while you are wielding a shield:\nIf you take the Attack action on your turn, you can use a bonus action to try to shove a creature within 5 feet of you with your shield.\nIf you aren't incapacitated, you can add your shield's AC bonus to any Dexterity saving throw you make against a spell or other harmful effect that targets only you.\nIf you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you can use your reaction to take no damage if you succeed on the saving throw, interposing your shield between yourself and the source of the effect.",
            "ability": "", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Skill Expert", 
            "prerequisite": "", 
            "description": "You have honed you r proficiency with particular skills, granting you the following benefits:\nIncrease one ability score of your choice by 1, to a maximum of 20.\nYou gain proficiency in one skill of your choice.\nChoose one skill in which you have proficiency. You gain expertise with that skill, which means your proficiency bonus is doubled for any ability check you make with it. The skill you choose must be one that isn't already benefiting from a feature, such as Expertise, that doubles your proficiency bonus.",
            "ability": "str dex con int wis ch a",
            "source": "TCE" 
        }, 
        "001":{ 
            "name": "Skilled", 
            "prerequisite": "", 
            "description": "You gain proficien cy in any combination of three skills or tools of your choice.",
            "ability": "", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Skulker", 
            "prerequisite": "Dexterity 13 or h igher",
            "description": "You are expert at slinking through shadows. You gain the following benefits:\nYou can try to hide when you are lightly obscured from the creature from which you are hiding.\nWhen you are hidden from a creature and miss it with a ranged weapon attack, making the attack doesn't reveal your position.\nDim light doesn't impose disadvantage on your Wisdom (Perception) checks relying on sight.",
            "ability": "", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Slasher", 
            "prerequisite": "", 
            "description": "You've learned whe re to cut to have the greatest results, granting you the following benefits:\nIncrease your Strength or Dexterity by 1, to a maximum of 20.\nOnce per turn when you hit a creature with an attack that deals slashing damage, you can reduce the speed of the target by 10 feet until the start of your next turn.\nWhen you score a critical hit that deals slashing damage to a creature, you grievously wound it. Until the start of your next turn, the target has disadvantage on all attack rolls.",
            "ability": "str dex", 
            "source": "TCE" 
        }, 
        "001":{ 
            "name": "Spell Sniper", 
            "prerequisite": "The ability to ca st at least one spell",
            "description": "You have learned t echniques to enhance your attacks with certain kinds of spells, gaining the following benefits:\nWhen you cast a spell that requires you to make an attack roll, the spell's range is doubled.\nYour ranged spell attacks ignore half cover and three-quarters cover.\nYou learn one cantrip that requires an attack roll. Choose the cantrip from the bard, cleric, druid, sorcerer, warlock, or wizard spell list. Your spellcasting ability for this cantrip depends on the spell list you chose from: Charisma for bard, sorcerer, or warlock; Wisdom for cleric or druid; or Intelligence for wizard.",
            "ability": "", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Squat Nimbleness", 
            "prerequisite": "Dwarf or a Small race",
            "description": "You are uncommonly nimble for your race. You gain the following benefits:\nIncrease your Strength or Dexterity by 1, to a maximum of 20.\nIncrease your walking speed by 5 feet.\nYou gain proficiency in the Acrobatics or Athletics skill (your choice).\nYou have advantage on any Strength (Athletics) or Dexterity (Acrobatics) check you make to escape from being grappled.",
            "ability": "str dex", 
            "source": "XGE" 
        }, 
        "001":{ 
            "name": "Svirfneblin Magic", 
            "prerequisite": "Gnome (deep)", 
            "description": "You have inherited the innate spellcasting ability of your ancestors. This ability allows you to cast nondetection on yourself at will, without needing a material component. You can also cast each of the following spells once with this ability: blindness/deafness, blur, and disguise self. You regain the ability to cast these spells when you finish a long rest.\nIntelligence is your spellcasting ability for these spells, and you cast them at their lowest possible levels.",
            "ability": "", 
            "source": "MTF" 
        }, 
        "001":{ 
            "name": "Tavern Brawler", 
            "prerequisite": "", 
            "description": "Accustomed to roug h-and-tumble fighting using whatever weapons happen to be at hand, you gain the following benefits:\nIncrease your Strength or Constitution by 1, to a maximum of 20.\nYou are proficient with improvised weapons.\nYour unarmed strike uses a d4 for damage.\nWhen you hit a creature with an unarmed strike or an improvised weapon on your turn, you can use a bonus action to attempt to grapple the target.",
            "ability": "str con", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Telekinetic", 
            "prerequisite": "", 
            "description": "You learn to move things with your mind, granting you the following benefits:\nIncrease your Intelligence, Wisdom, or Charisma by 1, to a maximum of 20.\nYou learn the mage hand cantrip. You can cast it without verbal or somatic components, and you can make the spectral hand invisible. If you already know this spell, its range increases by 30 feet when you cast it. Its spellcasting ability is the ability increased by this feat.\nAs a bonus action, you can try to telekinetically shove one creature you can see within 30 feet of you. When you do so, the target must succeed on a Strength saving throw (DC 8 + your proficiency bonus + the ability modifier of the score increased by this feat) or be moved 5 feet toward you or away from you. A creature can willingly fail this save.",
            "ability": "int wis cha", 
            "source": "TCE" 
        }, 
        "001":{ 
            "name": "Telepathic", 
            "prerequisite": "", 
            "description": "You awaken the abi lity to mentally connect with others, granting you the following benefits:\nIncrease your Intelligence, Wisdom, or Charisma by 1, to a maximum of 20.\nYou can speak telepathically to any creature you can see within 60 feet of you. Your telepathic utterances are in a language you know, and the creature understands you only if it knows that language. Your communication doesn't give the creature the ability to respond to you telepathically.\nYou can cast the detect thoughts spell, requiring no spell slot or components, and you must finish a long rest before you can cast it this way again. Your spellcasting ability for the spell is the ability increased by this feat. If you have spell slots of 2nd level or higher, you can cast this spell with them.",
            "ability": "int wis cha", 
            "source": "TCE" 
        }, 
        "001":{ 
            "name": "Tough", 
            "prerequisite": "", 
            "description": "Your hit point max imum increases by an amount equal to twice your level when you gain this feat. Whenever you gain a level thereafter, your hit point maximum increases by an additional 2 hit points.",
            "ability": "", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "War Caster", 
            "prerequisite": "The ability to ca st at least one spell",
            "description": "You have practiced casting spells in the midst of combat, learning techniques that grant you the following benefits:\nYou have advantage on Constitution saving throws that you make to maintain your concentration on a spell when you take damage.\nYou can perform the somatic components of spells even when you have weapons or a shield in one or both hands.\nWhen a hostile creature's movement provokes an opportunity attack from you, you can use your reaction to cast a spell at the creature, rather than making an opportunity attack. The spell must have a casting time of 1 action and must target only that creature.",
            "ability": "", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Weapon Master", 
            "prerequisite": "", 
            "description": "You have practiced extensively with a variety of weapons, gaining the following benefits:\nIncrease your Strength or Dexterity by 1, to a maximum of 20.\nYou gain proficiency with four weapons of your choice. Each one must be a simple or a martial weapon.",
            "ability": "str dex", 
            "source": "PHB" 
        }, 
        "001":{ 
            "name": "Wood Elf Magic", 
            "prerequisite": "Elf (wood)", 
            "description": "You learn the magi c of the primeval woods, which are revered and protected by your people. You learn one druid cantrip of your choice. You also learn the longstrider and pass without trace spells, each of which you can cast once without expending a spell slot. You regain the ability to cast these two spells in this way when you finish a long rest. Wisdom is your spellcasting ability for all three spells.",
            "ability": "", 
            "source": "XGE" 
        }, 
        "001":{ 
            "name": "Battlemage", 
            "prerequisite": "Spellcasting or P act Magic feature",
            "description": "You've learned to empower your spells, drawing every bit of power you can from the Weave. You gain the following benefits:\n\nYou no longer have disadvantage on ranged spell attacks against targets within 5 feet.\n\nBefore you make a spell attack roll for damaging spell or cantrip, you can choose to take a -5 penalty on the attack roll. If the attack hits, you add +10 damage to the spells damage.\n\nOnce per short rest, when you kill a creature with a spell attack, you can use a bonus action to redirect the remaining damage to another target within 5 feet of the slain creature. None of the spells other effects transfer to the second target.",
            "ability": "", 
            "source": "MAX" 
        }, 
        "001":{ 
            "name": "Barbarian: Ferocious Strength", 
            "prerequisite": "5th level, Streng th or Constitution 13 or higher",
            "description": "You strike with gr eat force and wonton abandon. You gain the Reckless Attack feature. \n\nIf you are a Barbarian. You do not suffer the downsides of Reckless attack if you do so on the same turn that you Rage. You also gain advantage on attacks until the start of your next turn, including your opportunity attacks.",
            "ability": "", 
            "source": "MAX" 
        }, 
        "001":{ 
            "name": "Blind Fighting", 
            "prerequisite": "Proficiency with medium armour, and Wisdom 15",
            "description": "You've spent many hours practicing fighting without the use of your eyes. You gain the following benefits:\n\nIncrease your Wisdom by 1, to a maximum of 20.\n\nAs a bonus action, you can gain Blindsight out to 30 ft. until the start of your next turn, replacing any other type of vision you currently have. You cannot benefit from this ability if you are Deafened. You can use this ability a number of times equal to your Wisdom modifier. You regain all uses after a long rest.",
            "ability": "wis", 
            "source": "MAX" 
        }, 
        "001":{ 
            "name": "Cleric: Bane of the Undead", 
            "prerequisite": "5th level, and Wi sdom 15",
            "description": "Through force of w ill and the aid of a greater power, you have learned to drive back the dead.\n\nOnce per long rest, you may Turn Undead, as though you were a cleric. The DC equals 8 + proficiency + Wisdom modifier.\n\nIf you are a Cleric. You instead gain an additional use of Channel Divinity.",
            "ability": "", 
            "source": "MAX" 
        }, 
        "001":{ 
            "name": "Close Combat Specialist", 
            "prerequisite": "Dexterity 15, pro ficiency with firearms",
            "description": "You have developed a reflexive trigger instinct. You gain the following benefits:\n\nIncrease your Dexterity score by 1, to a maximum of 20.\n\nYou do not have disadvantage on attack rolls against targets within 5 feet of you.\n\nIf you are wielding a loaded firearm when an enemy comes within 20 feet of you, you may make an attack of opportunity against them.",
            "ability": "dex", 
            "source": "MAX" 
        }, 
        "001":{ 
        "name": "Combat Expertise", 
        "prerequisite": "Proficiency with all martial weapons",
        "description": "You have trained i n a variety of combat situations, learning how to make the most of your weapon.\n\nYou may add your proficiency modifier to your damage rolls with weapon attacks.\n\nWhen you critically hit, you add your weapon ability modifier and proficiency bonus twice.",
        "ability": "", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Commanders Authority", 
        "prerequisite": "Charisma 15", 
        "description": "You lead others to achieve victory against overwhelming odds. You gain the following benefits:\n\nIncrease your Strength, Dexterity, or Charisma by 1, to a maximum of 20.\n\nAs an action, you can command your allies to take an action of their choice. A number of allies up to your charisma modifier that are within 60 feet and can hear you may use their reactions to either make one weapon attack, cast a cantrip, or move their full movement without provoking attacks of opportunity. Once you use this ability, you cannot use it again until you finish a long rest.",
        "ability": "str dex cha", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Exceptional Attunement", 
        "prerequisite": "", 
        "description": "You have developed a particularly strong affinity for magical devices. You gain the following benefits:\n\nIncrease your Intelligence, Wisdom or Charisma by 1, to a maximum of 20.\n\nYou have advantage on Intelligence (Arcana) checks when investigating the nature of a magical object or device.\n\nThe maximum number of magical items you can attune to increases by 1. Other attunement limitations still apply.",
        "ability": "int wis cha", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Extra Conditioning", 
        "prerequisite": "Proficiency with medium or heavy armor",
        "description": "You have trained w ith armour long enough to improve your vitality while wearing it. You gain the following benefits:\n\nIncrease your Strength score by 1, to a maximum of 20.\n\nWhen you complete a long rest, you gain temporary hit points equal to 5 times your proficiency modifier.",
        "ability": "str", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Fighter: Tireless Warrior", 
        "prerequisite": "5th level, Streng th or Dexterity or Constitution 15",
        "description": "Through long hours of combat, you have learned to steel yourself against pain to stay in the fight.\n\nAs a bonus action, you may regain hit points equal to 1d10 + you Constitution modifier. Once you have used this ability, you cannot use it again until after a short rest.\n\nIf you are a Fighter. You instead gain twice as many hit points when you use your Second Wind feature",
        "ability": "", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Fighting Style Training", 
        "prerequisite": "", 
        "description": "Youve trained i n a specific style of combat, gaining the following benefits:\n\nIncrease your Strength or Dexterity by 1, to a maximum of 20.\n\nYou learn one fighting style available to the fighter class. You cannot take a fighting style more than once.",
        "ability": "str dex", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Firearms Training", 
        "prerequisite": "Dexterity 13", 
        "description": "Upon taking this f eat, you gain the following benefits:\n\nIncrease your Dexterity score by 1, to a maximum of 20.\n\nYou become proficient with firearms.\n\nYou may maintain firearms and craft ammunition with tinkers tools. You can produce up to 40 rounds of firearm ammunition over the course of a working day. A single round costs 1 silver piece to craft in raw materials.",
        "ability": "dex", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Focused Mind", 
        "prerequisite": "Spellcasting or P act Magic feature",
        "description": "You have perfected a technique that allows you to maintain focus on your spellcasting, gaining the following benefits:\n\nIncrease your Intelligence, Wisdom, or Charisma by 1, to a maximum of 20.\n\nYou can attempt to concentrate on two spells at once. The combined spell level cannot exceed the highest spell slot level you have available. When doing so, you only make one concentration check for both spells. If you fail, both spells end. Additionally, when you make a concentration check, the DC is 10 + the combined spell level or half the damage taken, whichever is higher.",
        "ability": "int wis cha", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Heroic Rescue", 
        "prerequisite": "Extra Attack feat ure, Charisma 15",
        "description": "You know nothing o f fear, and when an ally is in danger, you will gladly leap to their defense. You gain the following benefits:\n\nIncrease your Strength, Dexterity, Constitution or Charisma score by 1, to a maximum of 20.\n\nWhen an ally within your movement range is reduced to 0 hit points, you may use your",
        "ability": "str dex con cha", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Lightning Reflexes", 
        "prerequisite": "", 
        "description": "You have developed an almost supernatural sense for danger, gifting you the following benefits:\n\nIncrease your Dexterity score by 1, to a maximum of 20.\n\nYou may add your proficiency bonus when rolling initiative.\n\nWhen you are hit by an attack, you may use your reaction to attempt to avoid the blow. Make a Dexterity saving throw against a DC equal to 10 + the enemys attack bonus. If you succeed, the attack misses and you may move up to half your movement without provoking attacks of opportunity. Once you use this ability, you cannot use it again until after a short or long rest.",
        "ability": "dex", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Light Weapon Master", 
        "prerequisite": "", 
        "description": "The amount of time you have invested in training with light weapons confers the following benefits:\n\nWhen you score a critical hit or reduce a creature to 0 hit points while wielding a light weapon, you may move up to half your movement without provoking attacks of opportunity. You may do this a number of times equal to your dexterity modifier, regaining uses after a long rest.\n\nYou may use your bonus action to make one attack with a light weapon you are holding, or two attacks if you are dual wielding and have taken the Attack action this turn.",
        "ability": "", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Monk: Martial Artist", 
        "prerequisite": "5th level, Wisdom or Dexterity 15",
        "description": "You have great con trol over your fists. You gain the Martial Arts feature.\n\nIf you are a Monk. You instead gain 2 additional Ki points.",
        "ability": "", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Monkey Grip", 
        "prerequisite": "Strength 15", 
        "description": "Your hands have al most unnatural strength. You gain the following benefits:\n\nYou ignore the heavy property of weapons.\n\nYou may wield two-handed melee weapons in one hand. \n\nYou may wield versatile weapons with a single hand and still use the two-handed damage die.",
        "ability": "", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Opportunist", 
        "prerequisite": "", 
        "description": "In the heat of the moment, you know when best to act. You gain the following benefits:\n\nIncrease your Dexterity or Wisdom by 1, to a maximum of 20.\n\nOnce per short rest, you may trade places in the initiative order with another willing creature, provided neither of you are surprised nor incapacitated.\n\nYou may hold your bonus action, in the same manner you would hold an action.",
        "ability": "dex wis", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Practiced Metamagician", 
        "prerequisite": "Charisma 15, Spel lcasting or Pact Magic feature",
        "description": "You have refined y our spellcasting, gaining the ability to twist your spells to suit your needs.\n\nYou learn one metamagic option from among those available to the sorcerer class that requires at most 2 sorcery points. You gain 2 sorcery points.\nIf you are a Sorcerer. You instead gain 3 sorcery points and may choose any metamagic option you want.",
        "ability": "", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Precision Critical", 
        "prerequisite": "Proficiency with all martial weapons",
        "description": "Your experience wi th weapons allows you to cause maximum damage with successful attacks.\n\nIncrease your Strength or Dexterity by 1, to a maximum of 20.\n\nWhen making a weapon attack, if you exceed your targets armour class by 10 or more you deal additional bonus damage equal to your level.",
        "ability": "str dex", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Precision Shot", 
        "prerequisite": "Dexterity 15, pro ficiency with firearms",
        "description": "Your shots are une rring. You gain the following benefits:\n\nIncrease your Dexterity score by 1, to a maximum of 20.\n\nWhen you make a regular attack with a firearm, you may choose to double your proficiency bonus on the attack roll, but at the cost of dealing minimum damage. On a critical hit, all damage dealt (including modifiers) is doubled.",
        "ability": "dex", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Rapid Recall", 
        "prerequisite": "The ability to pr epare spells",
        "description": "You have honed you r mind to memorize the complexities of spells quickly, gaining the following benefits:\n\nOver the course of a short rest, you can prepare one spell you know, replacing another spell you have prepared. If you are a wizard, you must have access to your spellbook. Once you use this ability, you must finish a long rest before you can use it again.\n\nAs an action, you can prepare one spell you know, replacing another spell you currently have prepared. If you are a wizard, you must have access to your spellbook. Once you use this ability, you must finish a long rest before you can use it again.",
        "ability": "", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Rogue: Backstabber", 
        "prerequisite": "5th level, Dexter ity 15",
        "description": "You know how to ex ploit you enemies weaknesses. You gain the Sneak Attack feature, gaining a number of d6s equal to half your proficiency modifier, rounded down.\n\nIf you are a Rogue. Once per turn, you may reroll 1s when rolling sneak attack damage, taking the second result.",
        "ability": "", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Safe Casting", 
        "prerequisite": "Spellcasting or P act Magic feature, Spellcasting score 15",
        "description": "You have trained i n the art of casting dangerous spells, and have learned to avoid the dangers of the magic you weave. When you cast a spell that would force you to make a saving throw, you can choose to be unaffected by it.",
        "ability": "", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Sorcerer: Practiced Metamagician", 
        "prerequisite": "5th level, Charis ma 15, Spellcasting or Pact Magic feature",
        "description": "You have refined y our spellcasting, gaining the ability to twist your spells to suit your needs.\n\nYou learn one metamagic option from among those available to the sorcerer class that requires at most 2 sorcery points. You gain 2 sorcery points.\n\nIf you are a Sorcerer. You instead gain 4 sorcery points and may choose any metamagic option you want.",
        "ability": "", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Skill Mastery", 
        "prerequisite": "", 
        "description": "Choose one skill i n which you are proficient. Gain the following benefits:\n\nThe relevant ability score increases by 1, to a maximum of 20.\n\nYou gain expertise in the chosen skill, if you dont have it already.\n\nOnce per short rest, you may reroll a failed check that uses the chosen skill.",
        "ability": "str dex con int wis ch a",
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Overwatch", 
        "prerequisite": "Dexterity 15", 
        "description": "You know when to s trike and how. You gain the following benefits:\n\nIncrease your Strength or Dexterity score by 1, to a maximum of 20.\n\nWhen holding your action to attack, you may benefit from the Extra Attack feature if your reaction is triggered.\n\nEnemies trigger Opportunity attacks from you if they move more than 5 feet within your line of sight and have not taken the Disengage action. You may use a ranged weapon for the attack, but cannot do so if the target is outside your short range increment.",
        "ability": "str dex", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Sling Mastery", 
        "prerequisite": "", 
        "description": "You have learned t he secrets of making great use of the simplest of weapons. You gain the following benefits:\n\nYou gain a +1 bonus to attack rolls you make with a sling.\n\nWhen you use a sling, its damage die changes from a d4 to a d6 and you treat it as a light weapon.\n\nYou deal an additional d6 to creatures for each size category larger than you they are.",
        "ability": "", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Sniper", 
        "prerequisite": "Dexterity 15", 
        "description": "You have mastered the art of taking your time for the perfect shot.\n\nBeing prone doesn't impose disadvantage on your attack rolls with ranged weapons.\n\nWhen you are hidden from a creature and miss it with a ranged weapon attack, making the attack doesn't reveal your position.\n\nWhen you critically hit an enemy with a ranged weapon attack, they are Blinded until the end of their next turn.",
        "ability": "", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Thrown Arms Master", 
        "prerequisite": "", 
        "description": "Youve honed you r ability to lob weaponry into the fray, including weapons not meant for ranged combat. You gain the following benefits:\n\nIncrease your Strength or Dexterity score by 1, to a maximum of 20.\n\nSimple and martial melee weapons without the thrown property can be treated as if they have the thrown property. One-handed weapons have a range of 30 / 60, while two-handed weapons have a range of 15 / 30.\n\nWeapons that naturally have the thrown property increase their range by +30/+60.",
        "ability": "str dex", 
        "source": "CRTD" 
    }, 
        "001":{ 
        "name": "Quick Casting", 
        "prerequisite": "Spellcasting or P act Magic feature, Spellcasting score 15",
        "description": "You have spent man y hours committing one spell to memory, to the point where you can cast it in a fraction of a second. \n\nChoose one spell you know with a casting time of 1 action. The spell level must be equal to or lower than half your proficiency modifier, rounded down. The casting time of this spell is now a bonus action, when cast at its lowest level.\n\nYou may change the spell that benefits from this feat when you level up, or by spending 1 week practicing the new spell.",
        "ability": "", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Quick Recovery", 
        "prerequisite": "", 
        "description": "You have spent man y nights operating on minimal sleep, gaining the following benefits:\n\nIncrease your Constitution score by 1, to a maximum of 20.\n\nYou gain the benefits of a long rest over 4 hours rather than 8 - time spent sleeping, in trance, and resting is halved.\n\nYou lose two levels of exhaustion, rather than one, when you finish a long rest.\n\nWhen rolling hit dice to heal, you add your constitution modifier twice, rather than once.",
        "ability": "con", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Warlock: Eldritch Power", 
        "prerequisite": "5th level, Charis ma 15",
        "description": "You have a minor c onnection to some great power. You gain a single Eldritch invocation (you must still meet the requirements).\n\nIf you are a Warlock. In addition, you may change this invocation whenever you complete a long rest.",
        "ability": "", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Whip Mastery", 
        "prerequisite": "", 
        "description": "With a flick of th e wrist, you have great control of both your whip and your opponents. You gain the following benefits:\n\nYou gain a +1 bonus to attack rolls you make with a whip.\n\nWhen you use a whip, its damage die changes from d4 to d6 and you treat it as a light weapon.\n\nWhen you hit a creature no more than one size larger than you with a whip on your turn, you can use a bonus action to pull the target up to 5 feet towards you. When you do this, you can immediately try to grapple it, try to shove it to knock it prone, or make a melee attack against it with a different light melee weapon that you're holding in the other hand.",
        "ability": "", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Will to Survive", 
        "prerequisite": "Proficiency with medium armor",
        "description": "You refuse to fall to your enemies. You gain the following benefits:\n\nYou have advantage on death saving throws.\n\nIf you would be killed or knocked unconscious due to failing a saving throw, you may choose to succeed on the save. If you take damage to fall to 0 even on a success, you instead fall to 1 hit point. You may use this feature once per long rest.",
        "ability": "", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Wizard: Arcane Focus", 
        "prerequisite": "5th level, Intell egence 15, and Spellcasting or Pact Magic feature",
        "description": "You are able to dr aw upon a greater well of Arcane strength. You gain the Arcane Recovery feature. You regain a total level worth of slots equal to your highest spell slot.\n\nIf you are a Wizard. Instead, when you use your Arcane Recovery, you regain spell slots totalling your level, not half your Wizard level.",
        "ability": "", 
        "source": "MAX" 
    }, 
        "001":{ 
        "name": "Blade Mastery", 
        "prerequisite": "", 
        "description": "You master the sho rtsword, longsword, scimitar, rapier, and greatsword. You gain the following benefits when using any of them:\nYou gain a +1 bonus to attack rolls you make with the weapon.\nOn your turn, you can use your reaction to assume a parrying stance, provided you have the weapon in hand. Doing so grants you a +1 bonus to your AC until the start of your next turn or until you're not holding the weapon.\nWhen you make an opportunity attack with the weapon, you have advantage on the attack roll.",
        "ability": "", 
        "source": "UA" 
    }, 
        "001":{ 
        "name": "Fell Handed", 
        "prerequisite": "", 
        "description": "You master the han daxe, battleaxe, greataxe, warhammer, and maul. You gain the following benefits when using any of them:\nYou gain a +1 bonus to attack rolls you make with the weapon.\nWhenever you have advantage on a melee attack roll you make with the weapon and hit, you can knock the target prone if the lower of the two d20 rolls would also hit the target.\nWhenever you have disadvantage on a melee attack roll you make with the weapon, the target takes bludgeoning damage equal to your Strength modifier (minimum of 0) if the attack misses but the higher of the two d20 rolls would have hit.\nIf you use the Help action to aid an ally's melee attack while you're wielding the weapon, you knock the target's shield aside momentarily. In addition to the ally gaining advantage on the attack roll, the ally gains a +2 bonus to the roll if the target is using a shield.",
        "ability": "", 
        "source": "UA" 
    }, 
        "001":{ 
        "name": "Flail Mastery", 
        "prerequisite": "", 
        "description": "The flail is a tri cky weapon to use, but you have spent countless hours mastering it. You gain the following benefits:\nYou gain a +1 bonus to attack rolls you make with a flail.\nAs a bonus action on your turn, you can prepare yourself to extend your flail to sweep over targets' shields. Until the end of this turn, your attack rolls with a flail gain a +2 bonus against any target using a shield.\nWhen you hit with an opportunity attack using a flail, the target must succeed on a Strength saving throw (DC 8 + your proficiency bonus + your Strength modifier) or be knocked prone.",
        "ability": "", 
        "source": "UA" 
    }, 
        "001":{ 
        "name": "Spear Mastery", 
        "prerequisite": "", 
        "description": "Though the spear i s a simple weapon to learn, it rewards you for the time you have taken to master it. You gain the following benefits:\nYou gain a +1 bonus to attack rolls you make with a spear.\nWhen you use a spear, its damage die changes from a d6 to a d8, and from a d8 to a d10 when wielded with two hands. (This benefit has no effect if another feature has already improved the weapon's die.)\nYou can set your spear to receive a charge. As a bonus action, choose a creature you can see that is at least 20 feet away from you. If that creature moves within your spear's reach on its next turn, you can make a melee attack against it with your spear as a reaction. If the attack hits, the target takes an extra 1d8 piercing damage, or an extra 1d10 piercing damage if you wield the spear with two hands. You can't use this ability if the creature used the Disengage action before moving.\nAs a bonus action on your turn, you can increase your reach with a spear by 5 feet for the rest of your turn.You gain a +1 bonus to attack rolls you make with the weapon.\nOn your turn, you can use your reaction to assume a parrying stance, provided you have the weapon in hand. Doing so grants you a +1 bonus to your AC until the start of your next turn or until you're not holding the weapon.\nWhen you make an opportunity attack with the weapon, you have advantage on the attack roll.",
        "ability": "", 
        "source": "UA" 
    } 
} 
 }]  
